/* # ***** BEGIN LICENSE BLOCK ***** */
/* # Version: MPL 1.1/GPL 2.0/LGPL 2.1 */
/* # */
/* # The contents of this file are subject to the Mozilla Public License Version */
/* # 1.1 (the \"License\"); you may not use this file except in compliance with */
/* # the License. You may obtain a copy of the License at */
/* # http://www.mozilla.org/MPL/ */
/* # */
/* # Software distributed under the License is distributed on an \"AS IS\" basis, */
/* # WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License */
/* # for the specific language governing rights and limitations under the */
/* # License. */
/* # */
/* # The Original Code is TransforMiiX XSLT processor code. */
/* # */
/* # The Initial Developer of the Original Code is */
/* # Netscape Communications Corporation. */
/* # Portions created by the Initial Developer are Copyright (C) 2003 */
/* # the Initial Developer. All Rights Reserved. */
/* # */
/* # Contributor(s): */
/* #   Peter Van der Beken <peterv@propagandism.org> */
/* # */
/* # Alternatively, the contents of this file may be used under the terms of */
/* # either the GNU General Public License Version 2 or later (the \"GPL\"), or */
/* # the GNU Lesser General Public License Version 2.1 or later (the \"LGPL\"), */
/* # in which case the provisions of the GPL or the LGPL are applicable instead */
/* # of those above. If you wish to allow use of your version of this file only */
/* # under the terms of either the GPL or the LGPL, and not to allow others to */
/* # use your version of this file under the terms of the MPL, indicate your */
/* # decision by deleting the provisions above and replace them with the notice */
/* # and other provisions required by the GPL or the LGPL. If you do not delete */
/* # the provisions above, a recipient may use your version of this file under */
/* # the terms of any one of the MPL, the GPL or the LGPL. */
/* # */
/* # ***** END LICENSE BLOCK ***** */

"1" = "Parsing an XSLT stylesheet failed.";
"2" = "Parsing an XPath expression failed.";
"3" = "";
"4" = "XSLT transformation failed.";
"5" = "Invalid XSLT/XPath function.";
"6" = "XSLT Stylesheet (possibly) contains a recursion.";
"7" = "Attribute value illegal in XSLT 1.0.";
"8" = "An XPath expression was expected to return a NodeSet.";
"9" = "XSLT transformation was terminated by <xsl:message>.";
"10" = "A network error occured loading an XSLT stylesheet:";
"11" = "An XSLT stylesheet does not have an XML mimetype:";
"12" = "An XSLT stylesheet directly or indirectly imports or includes itself:";
"13" = "An XPath function was called with the wrong number of arguments.";
"14" = "An unknown XPath extension function was called.";
"15" = "XPath parse failure: ‘)’ expected:";
"16" = "XPath parse failure: invalid axis:";
"17" = "XPath parse failure: Name or Nodetype test expected:";
"18" = "XPath parse failure: ‘]’ expected:";
"19" = "XPath parse failure: invalid variable name:";
"20" = "XPath parse failure: unexpected end of expression:";
"21" = "XPath parse failure: operator expected:";
"22" = "XPath parse failure: unclosed literal:";
"23" = "XPath parse failure: ‘:’ unexpected:";
"24" = "XPath parse failure: ‘!’ unexpected, negation is not():";
"25" = "XPath parse failure: illegal character found:";
"26" = "XPath parse failure: binary operator expected:";
"27" = "An XSLT stylesheet load was blocked for security reasons.";
"28" = "Evaluating an invalid expression.";
"29" = "Unbalanced curly brace.";
"30" = "Creating an element with an invalid QName.";
"31" = "Variable binding shadows variable binding within the same template.";

"LoadingError" = "Error loading stylesheet: %S";
"TransformError" = "Error during XSLT transformation: %S";
